OpenFOAM-7/tutorials/compressible/rhoPorousSimpleFoam/angledDuctImplicit/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 200;

boundaryField
{
    front
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }

    back
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }

    walls
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }

    porosityWall
    {
        type            epsilonWallFunction;
        value           uniform 200;
    }

    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        value           uniform 200;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           uniform 200;
    }
}


// ************************************************************************* //
